# Page1

### Арифметические выражения

Сначала научимся считать. Мы уже знаем, что выводить строки можно с помощью команды `cout`. Точно так же можно выводить числа и результат вычисления выражений. Например, вот так выглядит программа, которая считает, чему равно `(2 + 3) * 5`:

```cpp
#include <iostream>

using namespace std;

int main() {
    cout << (2 + 3) * 5;
    return 0;
}
```

  

Если запустить эту программу, то она выведет `25`. Сначала посчитается результат вычисления арифметического выражения, а затем он будет выведен. Посмотрим, какие арифметические операции умеет выполнять C++:

Обозначение операции    Что она выполняет

     `+`           сложение

     `−`           вычитание

     `*`           умножение

     `/`           деление нацело

     `%`           вычисление остатка от деления

У операций на C++ тот же приоритет, что и в обычной математике. Сначала выполняется умножение, деление и вычисление остатка, затем сложение и вычитание. Влиять на порядок операций можно с помощью скобок. Минус бывает бинарный (это число минус число) и унарный (это просто минус число). Например, можно написать `(−2 + 3) * 4` — это будет корректным выражением с результатом `4`.

Гораздо интереснее операции деления и взятия остатка. С помощью операции деления можно узнать целую часть от деления одного числа на другое. Например, `7 / 3` будет равно `2`. А с помощью операции взятия остатка от деления можно узнать остаток от деления первого числа на второе. `7 % 3` будет равен `1`. Если число делится нацело, то остаток будет равен нулю, например, `8 % 4` даст `0`.
